########################################################################
#
#    FILE: Constraints file
#  VENDOR: Altera
# PROGRAM: Quartus II
# VERSION: Version 11.0 Build 208 07/03/2011 Service Pack 1 SJ Web Edition
#    DATE: Sat May 20 01:44:13 2017
#
########################################################################


#**************************************************************
# Create Clock
#**************************************************************

create_clock -name reg_wr -period 58.000 -waveform { 0.000 29.000 } $_col0


#**************************************************************
# Create Generated Clock
#**************************************************************



#**************************************************************
# Set Propagated Clock
#**************************************************************

set_propagated_clock [all_clocks]


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************



#**************************************************************
# Set Input Delay
#**************************************************************



#**************************************************************
# Set Output Delay
#**************************************************************



#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************



#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************

set_max_delay 15.000 -from $_col1_from -to $_col2_to
set_max_delay 15.000 -from $_col2_from -to $_col3_to
set_max_delay 15.000 -from $_col4_from -to $_col2_to
set_max_delay 15.000 -from $_col2_from -to $_col4_to
set_max_delay 10.000 -from $_col5_from -to $_col6_to
set_max_delay 50.000 -from $_col12_from -to $_col8_to
set_max_delay 25.000 -from $_col9_from -to $_col13_to


#**************************************************************
# Set Minimum Delay
#**************************************************************

set_min_delay 0.000 -from $_col10_from -to $_col2_to
set_min_delay 0.000 -from $_col2_from -to $_col11_to
set_min_delay 0.000 -from $_col5_from -to $_col6_to
set_min_delay -5.000 -from $_col9_from -to $_col13_to
set_min_delay 0.000 -from $_col12_from -to $_col8_to


#**************************************************************
# Set Input Transition
#**************************************************************

